esp-rs/esp-pacs/esp32s2/svd/esp32s2.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BB</name>
      <description>BB Peripheral</description>
      <groupName>BB</groupName>
      <baseAddress>0x3F41D000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BBPD_CTRL</name>
          <description>Baseband control register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DC_EST_FORCE_PD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_EST_FORCE_PU</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FFT_FORCE_PD</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FFT_FORCE_PU</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DEDICATED_GPIO</name>
      <description>DEDICATED_GPIO Peripheral</description>
      <groupName>DEDIC_GPIO</groupName>
      <baseAddress>0x3F4CF000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DEDICATED_GPIO</name>
        <value>27</value>
      </interrupt>
      <registers>
        <register>
          <name>OUT_DRT</name>
          <description>Dedicated GPIO directive output register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>This register is used to configure directive output value of 8-channel dedicated GPIO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_MSK</name>
          <description>Dedicated GPIO mask output register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OUT_VALUE</name>
              <description>This register is used to configure updated output value of 8-channel dedicated GPIO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_MSK</name>
              <description>This register is used to configure channels which would be updated. 1: corresponding channel's output would be updated.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_IDV</name>
          <description>Dedicated GPIO individual output register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x2</dimIncrement>
              <dimIndex>0-7</dimIndex>
              <name>CH%s</name>
              <description>Configure channel %s output value. 0: hold output value. 1: set output value. 2: clear output value. 3: inverse output value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_SCAN</name>
          <description>Dedicated GPIO output status register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OUT_STATUS</name>
              <description>GPIO out value configured by DEDIC_GPIO_OUT_DRT_REG, DEDIC_GPIO_OUT_MSK_REG, DEDIC_GPIO_OUT_IDV_REG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CPU</name>
          <description>Dedicated GPIO output mode selection register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-7</dimIndex>
              <name>SEL%s</name>
              <description>Select GPIO out value configured by registers or CPU instructions for channel %s. 0: Configured by registers. 1: configured by CPU instructions.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_DLY</name>
          <description>Dedicated GPIO input delay configuration register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x2</dimIncrement>
              <dimIndex>0-7</dimIndex>
              <name>CH%s</name>
              <description>Configure GPIO%s input delay. 0: no delay. 1: one clock delay. 2: two clock delay. 3: three clock delay.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_SCAN</name>
          <description>Dedicated GPIO input status register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN_STATUS</name>
              <description>GPIO input value after configured by DEDIC_GPIO_IN_DLY_REG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_RCGN</name>
          <description>Dedicated GPIO interrupts generation mode register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x3</dimIncrement>
              <dimIndex>0-7</dimIndex>
              <name>INTR_MODE_CH%s</name>
              <description>Configure channel %s interrupt generate mode. 
0/1: do not generate interrupt. 
2: low level trigger.
3: high level trigger. 
4: falling edge trigger. 
5: raising edge trigger. 
6/7: falling and raising edge trigger.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_RAW</name>
          <description>Raw interrupt status</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-7</dimIndex>
              <name>GPIO%s</name>
              <description>This interrupt raw bit turns to high level when dedicated GPIO%s has level/edge change configured by DEDIC_GPIO_INTR_RCGN_REG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_RLS</name>
          <description>Interrupt enable bits</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-7</dimIndex>
              <name>GPIO%s</name>
              <description>The enable bit for DEDIC_GPIO%s_INT_ST register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_ST</name>
          <description>Masked interrupt status</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-7</dimIndex>
              <name>GPIO%s</name>
              <description>This is the status bit for DEDIC_GPIO%s_INT_RAW when DEDIC_GPIO7_INT_ENA is set to 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_CLR</name>
          <description>Interrupt clear bits</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-7</dimIndex>
              <name>GPIO%s</name>
              <description>Set this bit to clear the DEDIC_GPIO%s_INT_RAW interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
