esp-rs/esp-pacs/esp32s2/svd/esp32s2.base.svd
        <register>
          <name>PRO_CPU_INTR_FROM_CPU_3_MAP</name>
          <description>CPU_INTR_FROM_CPU_3 interrupt configuration register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_CPU_INTR_FROM_CPU_3_MAP</name>
              <description>This register is used to map CPU_INTR_FROM_CPU_3 interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_SPI_INTR_1_MAP</name>
          <description>SPI_INTR_1 interrupt configuration register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_SPI_INTR_1_MAP</name>
              <description>This register is used to map SPI_INTR_1 interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_SPI_INTR_2_MAP</name>
          <description>SPI_INTR_2 interrupt configuration register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_SPI_INTR_2_MAP</name>
              <description>This register is used to map SPI_INTR_2 interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_SPI_INTR_3_MAP</name>
          <description>SPI_INTR_3 interrupt configuration register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_SPI_INTR_3_MAP</name>
              <description>This register is used to map SPI_INTR_3 interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_I2S0_INT_MAP</name>
          <description>I2S0_INT interrupt configuration register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_I2S0_INT_MAP</name>
              <description>This register is used to map I2S0_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_I2S1_INT_MAP</name>
          <description>I2S1_INT interrupt configuration register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_I2S1_INT_MAP</name>
              <description>This register is used to map I2S1_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_UART_INTR_MAP</name>
          <description>UART_INT interrupt configuration register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_UART_INTR_MAP</name>
              <description>This register is used to map UART_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_UART1_INTR_MAP</name>
          <description>UART1_INT interrupt configuration register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_UART1_INTR_MAP</name>
              <description>This register is used to map UART1_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_UART2_INTR_MAP</name>
          <description>UART2_INT interrupt configuration register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_UART2_INTR_MAP</name>
              <description>This register is used to map UART2_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_SDIO_HOST_INTERRUPT_MAP</name>
          <description>SDIO_HOST_INTERRUPT configuration register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_SDIO_HOST_INTERRUPT_MAP</name>
              <description>This register is used to map SDIO_HOST_INTERRUPT signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_PWM0_INTR_MAP</name>
          <description>PWM0_INTR interrupt configuration register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_PWM0_INTR_MAP</name>
              <description>This register is used to map PWM0_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_PWM1_INTR_MAP</name>
          <description>PWM1_INTR interrupt configuration register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_PWM1_INTR_MAP</name>
              <description>This register is used to map PWM1_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_PWM2_INTR_MAP</name>
          <description>PWM2_INTR interrupt configuration register</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_PWM2_INTR_MAP</name>
              <description>This register is used to map PWM2_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_PWM3_INTR_MAP</name>
          <description>PWM3_INTR interrupt configuration register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_PWM3_INTR_MAP</name>
              <description>This register is used to map PWM3_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_LEDC_INT_MAP</name>
          <description>LEDC_INTR interrupt configuration register</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_LEDC_INT_MAP</name>
              <description>This register is used to map LEDC_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_EFUSE_INT_MAP</name>
          <description>EFUSE_INT interrupt configuration register</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_EFUSE_INT_MAP</name>
              <description>This register is used to map EFUSE_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CAN_INT_MAP</name>
          <description>CAN_INT interrupt configuration register</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_CAN_INT_MAP</name>
              <description>This register is used to map CAN_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_USB_INTR_MAP</name>
          <description>USB_INT interrupt configuration register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_USB_INTR_MAP</name>
              <description>This register is used to map USB_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_RTC_CORE_INTR_MAP</name>
          <description>RTC_CORE_INTR interrupt configuration register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_RTC_CORE_INTR_MAP</name>
              <description>This register is used to map RTC_CORE_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_RMT_INTR_MAP</name>
          <description>RMT_INTR interrupt configuration register</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_RMT_INTR_MAP</name>
              <description>This register is used to map RMT_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_PCNT_INTR_MAP</name>
          <description>PCNT_INTR interrupt configuration register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_PCNT_INTR_MAP</name>
              <description>This register is used to map PCNT_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_I2C_EXT0_INTR_MAP</name>
          <description>I2C_EXT0_INTR interrupt configuration register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_I2C_EXT0_INTR_MAP</name>
              <description>This register is used to map I2C_EXT0_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_I2C_EXT1_INTR_MAP</name>
          <description>I2C_EXT1_INTR interrupt configuration register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_I2C_EXT1_INTR_MAP</name>
              <description>This register is used to map I2C_EXT1_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_RSA_INTR_MAP</name>
          <description>RSA_INTR interrupt configuration register</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_RSA_INTR_MAP</name>
              <description>This register is used to map RSA_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_SHA_INTR_MAP</name>
          <description>SHA_INTR interrupt configuration register</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_SHA_INTR_MAP</name>
              <description>This register is used to map SHA_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_AES_INTR_MAP</name>
          <description>AES_INTR interrupt configuration register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_AES_INTR_MAP</name>
              <description>This register is used to map AES_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_SPI2_DMA_INT_MAP</name>
          <description>SPI2_DMA_INT interrupt configuration register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_SPI2_DMA_INT_MAP</name>
              <description>This register is used to map AES_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_SPI3_DMA_INT_MAP</name>
          <description>SPI3_DMA_INT interrupt configuration register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_SPI3_DMA_INT_MAP</name>
              <description>This register is used to map SPI3_DMA_INT dma interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_WDG_INT_MAP</name>
          <description>WDG_INT interrupt configuration register</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_WDG_INT_MAP</name>
              <description>This register is used to map WDG_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TIMER_INT1_MAP</name>
          <description>TIMER_INT1 interrupt configuration register</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_TIMER_INT1_MAP</name>
              <description>This register is used to map TIMER_INT1 interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TIMER_INT2_MAP</name>
          <description>TIMER_INT2 interrupt configuration register</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_TIMER_INT2_MAP</name>
              <description>This register is used to map TIMER_INT2 interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TG_T0_EDGE_INT_MAP</name>
          <description>TG_T0_EDGE_INT interrupt configuration register</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_TG_T0_EDGE_INT_MAP</name>
              <description>This register is used to map TG_T0_EDGE_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TG_T1_EDGE_INT_MAP</name>
          <description>TG_T1_EDGE_INT interrupt configuration register</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_TG_T1_EDGE_INT_MAP</name>
              <description>This register is used to map TG_T1_EDGE_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TG_WDT_EDGE_INT_MAP</name>
          <description>TG_WDT_EDGE_INT interrupt configuration register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_TG_WDT_EDGE_INT_MAP</name>
              <description>This register is used to map TG_WDT_EDGE_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TG_LACT_EDGE_INT_MAP</name>
          <description>TG_LACT_EDGE_INT interrupt configuration register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_TG_LACT_EDGE_INT_MAP</name>
              <description>This register is used to map TG_LACT_EDGE_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TG1_T0_EDGE_INT_MAP</name>
          <description>TG1_T0_EDGE_INT interrupt configuration register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_TG1_T0_EDGE_INT_MAP</name>
              <description>This register is used to map TG1_T0_EDGE_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
