esp-rs/esp-pacs/esp32s2/svd/esp32s2.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PCNT</name>
      <description>Pulse Count Controller</description>
      <groupName>PCNT</groupName>
      <baseAddress>0x3F417000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x68</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PCNT</name>
        <value>51</value>
      </interrupt>
      <registers>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0xC</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>UNIT%s</name>
          <description>Cluster UNIT%s, containing U?_CONF0, U?_CONF1, U?_CONF2</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>CONF0</name>
            <description>Configuration register 0 for unit</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00003C10</resetValue>
            <fields>
              <field>
                <name>FILTER_THRES</name>
                <description>This sets the maximum threshold, in APB_CLK cycles, for the filter.
Any pulses with width less than this will be ignored when the filter is enabled.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FILTER_EN</name>
                <description>This is the enable bit for unit %s's input filter.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>THR_ZERO_EN</name>
                <description>This is the enable bit for unit %s's zero comparator.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>THR_H_LIM_EN</name>
                <description>This is the enable bit for unit %s's thr_h_lim comparator.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>THR_L_LIM_EN</name>
                <description>This is the enable bit for unit %s's thr_l_lim comparator.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>THR_THRES0_EN</name>
                <description>This is the enable bit for unit %s's thres0 comparator.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>THR_THRES1_EN</name>
                <description>This is the enable bit for unit %s's thres1 comparator.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <dim>2</dim>
                <dimIncrement>0x8</dimIncrement>
                <dimIndex>0-1</dimIndex>
                <name>CH%s_NEG_MODE</name>
                <description>Configures the behavior when the signal input of channel %s detects a negative edge.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <name>EdgeMode</name>
                  <enumeratedValue>
                    <name>Increment</name>
                    <description>Increase the counter</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Decrement</name>
                    <description>Decrease the counter</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Hold</name>
                    <description>No effect on counter</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field derivedFrom="CH%s_NEG_MODE">
                <dim>2</dim>
                <dimIncrement>0x8</dimIncrement>
                <dimIndex>0-1</dimIndex>
                <name>CH%s_POS_MODE</name>
                <description>Configures the behavior when the signal input of channel %s detects a positive edge.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <dim>2</dim>
                <dimIncrement>0x8</dimIncrement>
                <dimIndex>0-1</dimIndex>
                <name>CH%s_HCTRL_MODE</name>
                <description>Configures how the CHn_POS_MODE/CHn_NEG_MODE settings will be modified when the control signal is high.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <name>CtrlMode</name>
                  <enumeratedValue>
                    <name>Keep</name>
                    <description>No modification</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reverse</name>
                    <description>Invert behavior (increase -&gt; decrease</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Inhibit counter modification</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field derivedFrom="CH%s_HCTRL_MODE">
                <dim>2</dim>
                <dimIncrement>0x8</dimIncrement>
                <dimIndex>0-1</dimIndex>
                <name>CH%s_LCTRL_MODE</name>
                <description>Configures how the CHn_POS_MODE/CHn_NEG_MODE settings will be modified when the control signal is low.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONF1</name>
            <description>Configuration register 1 for unit 0</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>CNT_THRES0</name>
                <description>This register is used to configure the thres0 value for unit %s.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CNT_THRES1</name>
                <description>This register is used to configure the thres1 value for unit %s.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONF2</name>
            <description>Configuration register 2 for unit 0</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>CNT_H_LIM</name>
                <description>This register is used to configure the thr_h_lim value for unit %s.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CNT_L_LIM</name>
                <description>This register is used to configure the thr_l_lim value for unit %s.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>U%s_CNT</name>
          <description>Counter value for unit %s</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT</name>
              <description>This register stores the current pulse count value for unit %s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Interrupt raw status register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CNT_THR_EVENT_U%s</name>
              <description>The raw interrupt status bit for the PCNT_CNT_THR_EVENT_U%s_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Interrupt status register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CNT_THR_EVENT_U%s</name>
              <description>The masked interrupt status bit for the PCNT_CNT_THR_EVENT_U%s_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CNT_THR_EVENT_U%s</name>
              <description>The interrupt enable bit for the PCNT_CNT_THR_EVENT_U%s_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Interrupt clear register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CNT_THR_EVENT_U%s</name>
              <description>Set this bit to clear the PCNT_CNT_THR_EVENT_U%s_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>U%s_STATUS</name>
          <description>PNCT UNIT%s status register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ZERO_MODE</name>
              <description>The pulse counter status of PCNT_U%s corresponding to 0. 0: pulse counter decreases from positive to 0. 1: pulse counter increases from negative to 0. 2: pulse counter is negative. 3: pulse counter is positive.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>THRES1</name>
              <description>The latched value of thres1 event of PCNT_U%s when threshold event interrupt is valid. 1: the current pulse counter equals to thres1 and thres1 event is valid. 0: others.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>THRES0</name>
              <description>The latched value of thres0 event of PCNT_U%s when threshold event interrupt is valid. 1: the current pulse counter equals to thres0 and thres0 event is valid. 0: others.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L_LIM</name>
              <description>The latched value of low limit event of PCNT_U%s when threshold event interrupt is valid. 1: the current pulse counter equals to thr_l_lim and low limit event is valid. 0: others.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>H_LIM</name>
              <description>The latched value of high limit event of PCNT_U%s when threshold event interrupt is valid. 1: the current pulse counter equals to thr_h_lim and high limit event is valid. 0: others.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZERO</name>
              <description>The latched value of zero threshold event of PCNT_U%s when threshold event interrupt is valid. 1: the current pulse counter equals to 0 and zero threshold event is valid. 0: others.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Control register for all counters</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000055</resetValue>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x2</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CNT_RST_U%s</name>
              <description>Set this bit to clear unit%s's counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x2</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CNT_PAUSE_U%s</name>
              <description>Set this bit to pause unit%s's counter.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>The registers clock gate enable signal of PCNT module. 1: the registers can be read and written by application. 0: the registers can not be read or written by application</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>PCNT version control register</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x19072601</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>This is the PCNT version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
