esp-rs/esp-pacs/esp32s2/svd/esp32s2.base.svd
        <register>
          <name>PRO_DPORT_0</name>
          <description>PeriBus1 permission control register 0.</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_DPORT_LOCK</name>
              <description>Lock register. Setting to 1 locks PeriBus1 permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DPORT_1</name>
          <description>PeriBus1 permission control register 1.</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000F000</resetValue>
          <fields>
            <field>
              <name>PRO_DPORT_APB_PERIPHERAL_FORBID</name>
              <description>Setting to 1 denies PeriBus1 bus???s access to APB peripheral.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DPORT_RTCSLOW_SPLTADDR</name>
              <description>Configure the split address of RTC FAST for PeriBus1 access.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DPORT_RTCSLOW_L_R</name>
              <description>Setting to 1 grants PeriBus1 permission to read RTC FAST low address region.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DPORT_RTCSLOW_L_W</name>
              <description>Setting to 1 grants PeriBus1 permission to write RTC FAST low address region.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DPORT_RTCSLOW_H_R</name>
              <description>Setting to 1 grants PeriBus1 permission to read RTC FAST high address region.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DPORT_RTCSLOW_H_W</name>
              <description>Setting to 1 grants PeriBus1 permission to write RTC FAST high address region.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DPORT_RESERVE_FIFO_VALID</name>
              <description>Configure whether to enable read protection for user-configured FIFO address.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DPORT_2</name>
          <description>PeriBus1 permission control register 2.</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_DPORT_RESERVE_FIFO_0</name>
              <description>Configure read-protection address 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DPORT_3</name>
          <description>PeriBus1 permission control register 3.</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_DPORT_RESERVE_FIFO_1</name>
              <description>Configure read-protection address 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DPORT_4</name>
          <description>PeriBus1 permission control register 4.</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_DPORT_RESERVE_FIFO_2</name>
              <description>Configure read-protection address 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DPORT_5</name>
          <description>PeriBus1 permission control register 5.</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_DPORT_RESERVE_FIFO_3</name>
              <description>Configure read-protection address 3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DPORT_6</name>
          <description>PeriBus1 permission control register 6.</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_DPORT_ILG_CLR</name>
              <description>The clear signal for PeriBus1 access interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DPORT_ILG_EN</name>
              <description>The enable signal for PeriBus1 access interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DPORT_ILG_INTR</name>
              <description>PeriBus1 access interrupt signal.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DPORT_7</name>
          <description>PeriBus1 status register.</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_DPORT_ILG_ST</name>
              <description>Record the illegitimate information of PeriBus1. [25:6]: store the bits [21:2] of PeriBus1 address. [5]: 1 means atomic access, 0 means nonatomic access. [4]: if bits [31:22] of PeriBus1 address are 0xfd, then the bit value is 1, otherwise it is 0. [3:0]: PeriBus1 byte enables.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_AHB_0</name>
          <description>PeriBus2 permission control register 0.</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_AHB_LOCK</name>
              <description>Lock register. Setting to 1 locks PeriBus2 permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_AHB_1</name>
          <description>PeriBus2 permission control register 1.</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x0001F800</resetValue>
          <fields>
            <field>
              <name>PRO_AHB_RTCSLOW_0_SPLTADDR</name>
              <description>Configure the split address of RTCSlow_0 for PeriBus2 access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_AHB_RTCSLOW_0_L_F</name>
              <description>Setting to 1 grants PeriBus2 permission to fetch RTCSlow_0 low address region.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_AHB_RTCSLOW_0_L_R</name>
              <description>Setting to 1 grants PeriBus2 permission to read RTCSlow_0 low address region.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_AHB_RTCSLOW_0_L_W</name>
              <description>Setting to 1 grants PeriBus2 permission to write RTCSlow_0 low address region.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_AHB_RTCSLOW_0_H_F</name>
              <description>Setting to 1 grants PeriBus2 permission to fetch RTCSlow_0 high address region.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_AHB_RTCSLOW_0_H_R</name>
              <description>Setting to 1 grants PeriBus2 permission to read RTCSlow_0 high address region.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_AHB_RTCSLOW_0_H_W</name>
              <description>Setting to 1 grants PeriBus2 permission to write RTCSlow_0 high address region.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_AHB_2</name>
          <description>PeriBus2 permission control register 2.</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x0001F800</resetValue>
          <fields>
            <field>
              <name>PRO_AHB_RTCSLOW_1_SPLTADDR</name>
              <description>Configure the split address of RTCSlow_1 for PeriBus2 access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_AHB_RTCSLOW_1_L_F</name>
              <description>Setting to 1 grants PeriBus2 permission to fetch RTCSlow_1 low address region.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_AHB_RTCSLOW_1_L_R</name>
              <description>Setting to 1 grants PeriBus2 permission to read RTCSlow_1 low address region.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_AHB_RTCSLOW_1_L_W</name>
              <description>Setting to 1 grants PeriBus2 permission to write RTCSlow_1 low address region.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_AHB_RTCSLOW_1_H_F</name>
              <description>Setting to 1 grants PeriBus2 permission to fetch RTCSlow_1 high address region.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_AHB_RTCSLOW_1_H_R</name>
              <description>Setting to 1 grants PeriBus2 permission to read RTCSlow_1 high address region.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_AHB_RTCSLOW_1_H_W</name>
              <description>Setting to 1 grants PeriBus2 permission to write RTCSlow_1 high address region.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_AHB_3</name>
          <description>PeriBus2 permission control register 3.</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_AHB_ILG_CLR</name>
              <description>The clear signal for PeriBus2 access interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_AHB_ILG_EN</name>
              <description>The enable signal for PeriBus2 access interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_AHB_ILG_INTR</name>
              <description>PeriBus2 access interrupt signal.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_AHB_4</name>
          <description>PeriBus2 status register.</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_AHB_ILG_ST</name>
              <description>Record the illegitimate information of PeriBus2. [31:2]: store the bits [31:2] of PeriBus2 address. [1]: 1 means data access, 0 means instruction access. [0]: 1 means write operation, 0 means read operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TRACE_0</name>
          <description>Trace memory permission control register 0.</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_TRACE_LOCK</name>
              <description>Lock register. Setting to 1 locks trace function permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TRACE_1</name>
          <description>Trace memory permission control register 1.</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_TRACE_DISABLE</name>
              <description>Setting to 1 disables the trace memory function.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CACHE_0</name>
          <description>Cache permission control register 0.</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_CACHE_LOCK</name>
              <description>Lock register. Setting to 1 locks cache permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CACHE_1</name>
          <description>Cache permission control register 1.</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_CACHE_CONNECT</name>
              <description>Configure which SRAM Block will be occupied by Icache or Dcache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CACHE_2</name>
          <description>Cache permission control register 2.</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_CACHE_ILG_CLR</name>
              <description>The clear signal for cache access interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_CACHE_ILG_EN</name>
              <description>The enable signal for cache access interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_CACHE_ILG_INTR</name>
              <description>Cache access interrupt signal.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CACHE_3</name>
          <description>Icache status register.</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_CACHE_ILG_ST_I</name>
              <description>Record the illegitimate information of ICache to access memory. [16]: access enable, active low. [15:4]: store the bits [11:0] of address. [3:0]: Icache bus write byte enables, active low.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CACHE_4</name>
          <description>Dcache status register.</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_CACHE_ILG_ST_D</name>
              <description>Record the illegitimate information of Dcache to access memory. [16]: access enable, active low. [15:4]: store the bits [11:0] of address. [3:0]: Dcache bus write byte enables, active low.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APB_I_0</name>
          <description>Internal DMA permission control register 0.</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APB_I_LOCK</name>
              <description>Lock register. Setting to 1 locks internal DMA permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
