esp-rs/esp-pacs/esp32s2/svd/esp32s2.base.svd
        <register>
          <name>APB_PERIPHERAL_0</name>
          <description>Peripheral access permission control register 0.</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB_PERIPHERAL_LOCK</name>
              <description>Lock register. Setting to 1 locks TX Copy DMA permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_PERIPHERAL_1</name>
          <description>Peripheral access permission control register 1.</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>APB_PERIPHERAL_SPLIT_BURST</name>
              <description>Setting to 1 splits the data phase of the last access and the address phase of following access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCCUPY_0</name>
          <description>Occupy permission control register 0.</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OCCUPY_LOCK</name>
              <description>Lock register. Setting to 1 locks occupy permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCCUPY_1</name>
          <description>Occupy permission control register 1.</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OCCUPY_CACHE</name>
              <description>Configure whether SRAM Block 0-3 is used as cache memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCCUPY_2</name>
          <description>Occupy permission control register 2.</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OCCUPY_MAC_DUMP</name>
              <description>Configure whether SRAM Block 18-21 is used as mac dump.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCCUPY_3</name>
          <description>Occupy permission control register 3.</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OCCUPY_PRO_TRACE</name>
              <description>Configure one block of SRAM Block 4-21 is used as trace memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_TAG_ACCESS_0</name>
          <description>Cache tag permission control register 0.</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_TAG_ACCESS_LOCK</name>
              <description>Lock register. Setting to 1 locks cache tag permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_TAG_ACCESS_1</name>
          <description>Cache tag permission control register 1.</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_I_TAG_RD_ACS</name>
              <description>Setting to 1 permits read access to Icache tag memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_I_TAG_WR_ACS</name>
              <description>Setting to 1 permits write access to Icache tag memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_D_TAG_RD_ACS</name>
              <description>Setting to 1 permits read access to Dcache tag memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_D_TAG_WR_ACS</name>
              <description>Setting to 1 permits write access to Dcache tag memory.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_MMU_ACCESS_0</name>
          <description>Cache MMU permission control register 0.</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_MMU_ACCESS_LOCK</name>
              <description>Lock register. Setting to 1 locks cache MMU permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_MMU_ACCESS_1</name>
          <description>Cache MMU permission control register 1.</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>PRO_MMU_RD_ACS</name>
              <description>Setting to 1 permits read access to MMU memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_MMU_WR_ACS</name>
              <description>Setting to 1 permits write access to MMU memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_PERIPHERAL_INTR</name>
          <description>PeribBus2 permission control register.</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB_PERI_BYTE_ERROR_CLR</name>
              <description>The clear signal for APB peripheral interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB_PERI_BYTE_ERROR_EN</name>
              <description>The enable signal for APB peripheral access interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB_PERI_BYTE_ERROR_INTR</name>
              <description>APB peripheral access interrupt signal.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_PERIPHERAL_STATUS</name>
          <description>PeribBus2 peripheral access status register.</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB_PERI_BYTE_ERROR_ADDR</name>
              <description>Record the illegitimate address of  APB peripheral.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PERIPHERAL_INTR</name>
          <description>PeribBus1 permission control register.</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CPU_PERI_BYTE_ERROR_CLR</name>
              <description>The clear signal for CPU peripheral access interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_PERI_BYTE_ERROR_EN</name>
              <description>The enable signal for CPU peripheral access interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_PERI_BYTE_ERROR_INTR</name>
              <description>CPU peripheral access interrupt signal.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PERIPHERAL_STATUS</name>
          <description>PeribBus1 peripheral access status register.</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CPU_PERI_BYTE_ERROR_ADDR</name>
              <description>Record the illegitimate address of CPU peripheral.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock gate register of permission control.</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Enable the clock of permission control module when set to 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register.</description>
          <addressOffset>0xFFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x01905090</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
