esp-rs/esp-pacs/esp32s2/svd/esp32s2.base.svd
        <register>
          <name>SLOW_CLK_CONF</name>
          <description>RTC slow clock configuration register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400000</resetValue>
          <fields>
            <field>
              <name>ANA_CLK_DIV_VLD</name>
              <description>Synchronizes the reg_rtc_ana_clk_div bus. Note that you have to invalidate the bus before switching clock, and validate the new clock.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANA_CLK_DIV</name>
              <description>Set the rtc_clk divider.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOW_CLK_NEXT_EDGE</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_CONF</name>
          <description>configure vddsdio register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x02B0BE0A</resetValue>
          <fields>
            <field>
              <name>SDIO_TIMER_TARGET</name>
              <description>timer count to apply reg_sdio_dcap after sdio power on</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_DTHDRV</name>
              <description>Tieh = 1 mode drive ability. Initially set to 0 to limit charge current  set to 3 after several us.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_DCAP</name>
              <description>ability to prevent LDO from overshoot</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_INITI</name>
              <description>add resistor from ldo output to ground. 0: no res  1: 6k  2: 4k   3: 2k</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_EN_INITI</name>
              <description>0 to set init[1:0]=0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_DCURLIM</name>
              <description>tune current limit threshold when tieh = 0. About 800mA/(8+d)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_MODECURLIM</name>
              <description>select current limit mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_ENCURLIM</name>
              <description>enable current limit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_REG_PD_EN</name>
              <description>power down SDIO_REG in sleep. Only active when reg_sdio_force = 0</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_FORCE</name>
              <description>1: use SW option to control SDIO_REG   0: use state machine</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_TIEH</name>
              <description>SW option for SDIO_TIEH. Only active when reg_sdio_force = 1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG1P8_READY</name>
              <description>read only register for REG1P8_READY</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DREFL_SDIO</name>
              <description>SW option for DREFL_SDIO. Only active when reg_sdio_force = 1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DREFM_SDIO</name>
              <description>SW option for DREFM_SDIO. Only active when reg_sdio_force = 1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DREFH_SDIO</name>
              <description>SW option for DREFH_SDIO. Only active when reg_sdio_force = 1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPD_SDIO</name>
              <description>SW option for XPD_VOOSDIO. Only active when reg_sdio_force = 1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BIAS_CONF</name>
          <description>configure power register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00010800</resetValue>
          <fields>
            <field>
              <name>BIAS_BUF_IDLE</name>
              <description>open bias buf when system in active</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIAS_BUF_WAKE</name>
              <description>open bias buf when rtc in wakeup</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIAS_BUF_DEEP_SLP</name>
              <description>open bias buf when rtc in deep sleep</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIAS_BUF_MONITOR</name>
              <description>open bias buf when rtc in monitor state</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_CUR_DEEP_SLP</name>
              <description>xpd cur when rtc in sleep_state</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_CUR_MONITOR</name>
              <description>xpd cur when rtc in monitor state</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIAS_SLEEP_DEEP_SLP</name>
              <description>bias_sleep when rtc in sleep_state</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIAS_SLEEP_MONITOR</name>
              <description>bias_sleep when rtc in monitor state</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_ATTEN_DEEP_SLP</name>
              <description>DBG_ATTEN when rtc in sleep state</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_ATTEN_MONITOR</name>
              <description>DBG_ATTEN when rtc in monitor state</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENB_SCK_XTAL</name>
              <description>ENB_SCK_XTAL</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INC_HEARTBEAT_REFRESH</name>
              <description>INC_HEARTBEAT_REFRESH</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEC_HEARTBEAT_PERIOD</name>
              <description>DEC_HEARTBEAT_PERIOD</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INC_HEARTBEAT_PERIOD</name>
              <description>INC_HEARTBEAT_PERIOD</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEC_HEARTBEAT_WIDTH</name>
              <description>DEC_HEARTBEAT_WIDTH</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_BIAS_I2C</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG</name>
          <description>RTC/DIG regulator configuration register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0xA9002400</resetValue>
          <fields>
            <field>
              <name>DIG_REG_DBIAS_SLP</name>
              <description>Configures the regulation factor for the digital system voltage regulator when the CPU is in sleep status.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIG_REG_DBIAS_WAK</name>
              <description>Configures the regulation factor for the digital system voltage regulator when the CPU is in active status.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCK_DCAP</name>
              <description>Configures the frequency of the RTC clocks.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBIAS_SLP</name>
              <description>Configures the regulation factor for the low-power voltage regulator when the CPU is in sleep status.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBIAS_WAK</name>
              <description>Configures the regulation factor for the low-power voltage regulator when the CPU is in active status.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBOOST_FORCE_PD</name>
              <description>RTC_DBOOST force power down</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBOOST_FORCE_PU</name>
              <description>RTC_DBOOST force power up</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGULATOR_FORCE_PD</name>
              <description>Set this bit to FPD the RTC_REG, which means decreasing its voltage to 0.8 V or lower.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGULATOR_FORCE_PU</name>
              <description>Set this bit to FPU the RTC_REG.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWC</name>
          <description>RTC power configuraiton register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <resetValue>0x00012925</resetValue>
          <fields>
            <field>
              <name>FASTMEM_FORCE_NOISO</name>
              <description>Set this bit to disable the force isolation to the RTC fast memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTMEM_FORCE_ISO</name>
              <description>Set this bit to force isolate the RTC fast memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOWMEM_FORCE_NOISO</name>
              <description>Set this bit to disable the force isolation to the RTC slow memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOWMEM_FORCE_ISO</name>
              <description>Set this bit to force isolate the RTC slow memory.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ISO</name>
              <description>Set this bit to force isolate the RTC peripherals.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_NOISO</name>
              <description>Set this bit to disable the force isolation to the RTC peripherals.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTMEM_FOLW_CPU</name>
              <description>Set 1 to FPD the RTC fast memory when the CPU is powered down.  Set 0 to FPD the RTC fast memory when the RTC main state machine is powered down.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTMEM_FORCE_LPD</name>
              <description>Set this bit to force not retain the RTC fast memory.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTMEM_FORCE_LPU</name>
              <description>Set this bit to force retain the RTC fast memory.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOWMEM_FOLW_CPU</name>
              <description>Set 1 to FPD the RTC slow memory when the CPU is powered down.  Set 0 to FPD the RTC slow memory when the RTC main state machine is powered down.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOWMEM_FORCE_LPD</name>
              <description>Set this bit to force not retain the RTC slow memory.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOWMEM_FORCE_LPU</name>
              <description>Set this bit to force retain the RTC slow memory.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTMEM_FORCE_PD</name>
              <description>Set this bit to FPD the RTC fast memory.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTMEM_FORCE_PU</name>
              <description>Set this bit to FPU the RTC fast memory.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTMEM_PD_EN</name>
              <description>Set this bit to enable PD for the RTC fast memory in sleep.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOWMEM_FORCE_PD</name>
              <description>Set this bit to FPD the RTC slow memory.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOWMEM_FORCE_PU</name>
              <description>Set this bit to FPU the RTC slow memory.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOWMEM_PD_EN</name>
              <description>Set this bit to enable PD for the RTC slow memory in sleep.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_PD</name>
              <description>Set this bit to FPD the RTC peripherals.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_PU</name>
              <description>Set this bit to FPU the RTC peripherals.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_EN</name>
              <description>Set this bit to enable PD for the RTC peripherals in sleep.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_FORCE_HOLD</name>
              <description>Set this bit the force hold the RTC GPIOs.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
