esp-rs/esp-pacs/esp32s2/svd/esp32s2.base.svd
        <register>
          <name>FRONT_END_MEM_PD</name>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000015</resetValue>
          <fields>
            <field>
              <name>AGC_MEM_FORCE_PU</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_MEM_FORCE_PD</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBUS_MEM_FORCE_PU</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBUS_MEM_FORCE_PD</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_MEM_FORCE_PU</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_MEM_FORCE_PD</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x01907010</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSTEM</name>
      <description>System Configuration Registers</description>
      <groupName>SYSTEM</groupName>
      <baseAddress>0x3F4C0000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x94</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ROM_CTRL_0</name>
          <description>System ROM configuration register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>ROM_FO</name>
              <description>This field is used to force on clock gate of internal ROM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROM_CTRL_1</name>
          <description>System ROM configuration register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000C</resetValue>
          <fields>
            <field>
              <name>ROM_FORCE_PD</name>
              <description>This field is used to power down internal ROM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROM_FORCE_PU</name>
              <description>This field is used to power up internal ROM.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM_CTRL_0</name>
          <description>System SRAM configuration register 0</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x003FFFFF</resetValue>
          <fields>
            <field>
              <name>SRAM_FO</name>
              <description>This field is used to force on clock gate of internal SRAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM_CTRL_1</name>
          <description>System SRAM configuration register 1</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SRAM_FORCE_PD</name>
              <description>This field is used to power down internal SRAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PERI_CLK_EN</name>
          <description>CPU peripheral clock enable register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLK_EN_DEDICATED_GPIO</name>
              <description>Set this bit to enable clock of DEDICATED GPIO module.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PERI_RST_EN</name>
          <description>CPU peripheral reset register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>RST_EN_DEDICATED_GPIO</name>
              <description>Set this bit to reset DEDICATED GPIO module.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PER_CONF</name>
          <description>CPU peripheral clock configuration register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000C</resetValue>
          <fields>
            <field>
              <name>CPUPERIOD_SEL</name>
              <description>This field is used to select the clock frequency of CPU or CPU period.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_FREQ_SEL</name>
              <description>This field is used to select the PLL clock frequency based on CPU period.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_WAIT_MODE_FORCE_ON</name>
              <description>Set this bit to force on CPU wait mode. In this mode, the clock gate of CPU is turned off until any interrupts happen. This mode could also be force on via WAITI instruction.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_WAITI_DELAY_NUM</name>
              <description>Sets the number of delay cycles to enter CPU wait mode after a WAITI instruction.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAG_CTRL_0</name>
          <description>JTAG configuration register 0</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_0</name>
              <description>Stores the 0 to 31 bits of the 256 bits register used to cancel the temporary disable of eFuse to JTAG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAG_CTRL_1</name>
          <description>JTAG configuration register 1</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_1</name>
              <description>Stores the 32 to 63 bits of the 256 bits register used to cancel the temporary disable of eFuse to JTAG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAG_CTRL_2</name>
          <description>JTAG configuration register 2</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_2</name>
              <description>Stores the 64 to 95 bits of the 256 bits register used to cancel the temporary disable of eFuse to JTAG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAG_CTRL_3</name>
          <description>JTAG configuration register 3</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_3</name>
              <description>Stores the 96 to 127 bits of the 256 bits register used to cancel the temporary disable of eFuse to JTAG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAG_CTRL_4</name>
          <description>JTAG configuration register 4</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_4</name>
              <description>Stores the 128 to 159 bits of the 256 bits register used to cancel the temporary disable of eFuse to JTAG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAG_CTRL_5</name>
          <description>JTAG configuration register 5</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_5</name>
              <description>Stores the 160 to 191 bits of the 256 bits register used to cancel the temporary disable of eFuse to JTAG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAG_CTRL_6</name>
          <description>JTAG configuration register 6</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_6</name>
              <description>Stores the 192 to 223 bits of the 256 bits register used to cancel the temporary disable of eFuse to JTAG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAG_CTRL_7</name>
          <description>JTAG configuration register 7</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_7</name>
              <description>Stores the 0 to 224 bits of the 255 bits register used to cancel the temporary disable of eFuse to JTAG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_PD_MASK</name>
          <description>Memory power-related controlling register (under low-sleep)</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>LSLP_MEM_PD_MASK</name>
              <description>Set this bit to allow the memory to work as usual when the chip enters the light-sleep state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIP_CLK_EN0</name>
          <description>System peripheral clock (for hardware accelerators) enable register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0xF9C1E06F</resetValue>
          <fields>
            <field>
              <name>TIMERS_CLK_EN</name>
              <description>Set this bit to enable clock of timers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI01_CLK_EN</name>
              <description>Set this bit to enable clock of SPI0 and SPI1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_CLK_EN</name>
              <description>Set this bit to enable clock of UART0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDG_CLK_EN</name>
              <description>Set this bit to enable clock of WDG.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S0_CLK_EN</name>
              <description>Set this bit to enable clock of I2S0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_CLK_EN</name>
              <description>Set this bit to enable clock of UART1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_CLK_EN</name>
              <description>Set this bit to enable clock of SPI2.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_EXT0_CLK_EN</name>
              <description>Set this bit to enable clock of I2C EXT0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UHCI0_CLK_EN</name>
              <description>Set this bit to enable clock of UHCI0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_CLK_EN</name>
              <description>Set this bit to enable clock of remote controller.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT_CLK_EN</name>
              <description>Set this bit to enable clock of pulse count.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_CLK_EN</name>
              <description>Set this bit to enable clock of LED PWM.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UHCI1_CLK_EN</name>
              <description>Set this bit to enable clock of UHCI1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMERGROUP_CLK_EN</name>
              <description>Set this bit to enable clock of timer group0.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EFUSE_CLK_EN</name>
              <description>Set this bit to enable clock of eFuse.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMERGROUP1_CLK_EN</name>
              <description>Set this bit to enable clock of timer group1.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI3_CLK_EN</name>
              <description>Set this bit to enable clock of SPI3.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM0_CLK_EN</name>
              <description>Set this bit to enable clock of PWM0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_EXT1_CLK_EN</name>
              <description>Set this bit to enable clock of I2C EXT1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TWAI_CLK_EN</name>
              <description>Set this bit to enable clock of CAN.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM1_CLK_EN</name>
              <description>Set this bit to enable clock of PWM1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S1_CLK_EN</name>
              <description>Set this bit to enable clock of I2S1.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_DMA_CLK_EN</name>
              <description>Set this bit to enable clock of SPI2 DMA.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CLK_EN</name>
              <description>Set this bit to enable clock of USB.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_MEM_CLK_EN</name>
              <description>Set this bit to enable clock of UART memory.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM2_CLK_EN</name>
              <description>Set this bit to enable clock of PWM2.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM3_CLK_EN</name>
              <description>Set this bit to enable clock of PWM3.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI3_DMA_CLK_EN</name>
              <description>Set this bit to enable clock of SPI3 DMA.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB_SARADC_CLK_EN</name>
              <description>Set this bit to enable clock of SAR ADC.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTIMER_CLK_EN</name>
              <description>Set this bit to enable clock of system timer.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2_ARB_CLK_EN</name>
              <description>Set this bit to enable clock of aribiter of ADC2.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI4_CLK_EN</name>
              <description>Set this bit to enable clock of SPI4.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
